In [1]:
from sqlalchemy import create_engine
import pandas as pd   
import numpy as np  
import matplotlib.pyplot as plt  
import seaborn as sns

In [2]:
database_name = 'scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

engine = create_engine(connection_string)

In [3]:
query = '''
SELECT *
FROM scooters
limit 800;
'''

In [4]:
with engine.connect() as connection:
    test = pd.read_sql(query, con = connection)

test.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-31 23:55:54.303,36.15898,-86.78244,Powered9641182,Powered,98.0,Scooter,0.23,Spin
1,2019-07-31 23:55:54.303,36.15816,-86.78335,Powered2444201,Powered,94.0,Scooter,0.23,Spin
2,2019-07-31 23:55:54.303,36.15665,-86.78107,Powered3844102,Powered,56.0,Scooter,0.23,Spin
3,2019-07-31 23:55:54.303,36.16273,-86.75022,Powered3919161,Powered,59.0,Scooter,0.23,Spin
4,2019-07-31 23:55:54.303,36.14078,-86.80806,Powered3689962,Powered,72.0,Scooter,0.23,Spin

In [5]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  800 non-null    datetime64[ns]
 1   latitude     800 non-null    float64
 2   longitude    800 non-null    float64
 3   sumdid       800 non-null    object
 4   sumdtype     800 non-null    object
 5   chargelevel  800 non-null    float64
 6   sumdgroup    800 non-null    object
 7   costpermin   800 non-null    float64
 8   companyname  800 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 56.4+ KB

In [6]:
text = '''
SELECT COUNT(sumdgroup)
FROM scooters
WHERE sumdgroup <> 'bicycle';
'''
with engine.connect() as connection:
    scooter_count = pd.read_sql(text, con = connection)
scooter_count

      count
0  73387514

770 nulls(in Scooters table) out of 73414043 entries

In [7]:
text = '''
SELECT min(pubdatetime), max(pubdatetime)
FROM scooters;
'''
with engine.connect() as connection:
    times_scooters = pd.read_sql(text, con = connection)
times_scooters

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [8]:
text = '''
SELECT min(pubtimestamp), max(pubtimestamp)
FROM trips;
'''
with engine.connect() as connection:
    times_trips = pd.read_sql(text, con = connection)
times_trips

                      min                 max
0 2019-05-01 00:00:55.423 2019-08-01 07:04:00

In [9]:
text = '''
SELECT *
FROM trips
LIMIT 100;
'''
with engine.connect() as connection:
    test2 = pd.read_sql(text, con = connection)
test2.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [10]:
text = '''
SELECT COUNT(DISTINCT sumdid), companyname
FROM trips
GROUP BY companyname
ORDER BY COUNT(DISTINCT sumdid) DESC;
'''
with engine.connect() as connection:
    company_scooters_trips = pd.read_sql(text, con = connection)
company_scooters_trips

   count    companyname
0   3766           Bird
1   1788           Lime
2   1725           Lyft
3    754           SPIN
4    450           JUMP
5    356  Bolt Mobility
6    166         Gotcha

In [ ]:
text = '''
SELECT COUNT(DISTINCT sumdid), companyname
FROM scooters
WHERE sumdgroup <> 'bicycle'
GROUP BY companyname;
'''
with engine.connect() as connection:
    company_scooters_scooters = pd.read_sql(text, con = connection)
company_scooters_scooters

In [ ]:
text = '''
SELECT COUNT(DISTINCT sumdid), companyname
FROM scooters
WHERE sumdgroup like 'Scooter'
GROUP BY companyname;
'''
with engine.connect() as connection:
    test3 = pd.read_sql(text, con = connection)
test3

In [ ]:
text = '''
SELECT COUNT(sumdid), sumdgroup
FROM scooters
GROUP BY sumdgroup;
'''
with engine.connect() as connection:
    sumdgroup_counts = pd.read_sql(text, con = connection)
sumdgroup_counts

Courtesy of Emmy Doore

query2='''
(select distinct sumdid,companyname, 'May' as month
from scooters
WHERE sumdgroup ilike 'scooter'
and pubdatetime < '2019-06-01 00:00:00'
group by sumdid,companyname
)
UNION
(select distinct sumdid,companyname, 'June' as month
from scooters
WHERE sumdgroup ilike 'scooter'
and pubdatetime < '2019-07-01 00:00:00'
and pubdatetime > '2019-05-31 00:00:00'
group by sumdid,companyname)
UNION
(select distinct sumdid,companyname, 'July' as month
from scooters
WHERE sumdgroup ilike 'scooter'
and pubdatetime > '2019-06-30 00:00:00'
group by sumdid,companyname);
'''

with engine.connect() as connection:
    over_time = pd.read_sql(text(query2), con = connection)

    over_time.head()

by_month=over_time.groupby(['companyname','month'])['sumdid'].count()
by_month=by_month.reset_index() #kept getting an error when trying to sort values, reseting index worked idk why
by_month=by_month.sort_values(by='companyname',ascending=False)
print(by_month)

query3='''
(select companyname, COUNT(distinct triprecordnum) as num_trips, round((sum(tripduration)/60),2) as hours_used, 'May' as month
from trips
where pubtimestamp < '2019-06-01 00:00:00'
and tripduration < 1440
and tripduration > 1
group by companyname
)
UNION
(select companyname, COUNT(distinct triprecordnum) as num_trips, round((sum(tripduration)/60),2) as hours_used,'June' as month
from trips
WHERE pubtimestamp < '2019-07-01 00:00:00'
and pubtimestamp > '2019-05-31 00:00:00'
and tripduration < 1440
and tripduration > 1
group by companyname)
UNION
(select companyname, COUNT(distinct triprecordnum) as num_trips,round((sum(tripduration)/60),2) as hours_used, 'July' as month
from trips
WHERE pubtimestamp > '2019-06-30 00:00:00'
and tripduration < 1440
and tripduration > 1
group by companyname);
'''

with engine.connect() as connection:    
    company_trips = pd.read_sql(text(query3), con = connection)

company_trips=company_trips.reset_index() 
company_trips=company_trips.sort_values(by='companyname',ascending=False)

print(company_trips)

In [ ]:
text = '''
SELECT COUNT(DISTINCT sumdid)
FROM trips;
'''
with engine.connect() as connection:
    total_trips = pd.read_sql(text, con = connection)
total_trips

In [ ]:
text = '''
SELECT 
    sumdid, 
    AVG(COUNT(sumdid)) OVER(PARTITION BY COUNT(DISTINCT enddate)) AS count_per_day
FROM trips
WHERE tripdistance > 1
GROUP BY sumdid;
'''
with engine.connect() as connection:
    counts_per_day = pd.read_sql(text, con = connection)
    
counts_per_day

In [ ]:
avg_counts = counts_per_day['count_per_day'].mean()
avg_counts

In [ ]:
more_than_3= counts_per_day[counts_per_day['count_per_day'] >= 3]
more_than_3

In [ ]:
text = '''
SELECT companyname, COUNT(tripduration) AS Instances_Of_Uncleaned_Data
FROM trips
WHERE tripduration < 1 OR tripduration > 1440 
GROUP BY companyname
ORDER BY COUNT(tripduration) DESC;
'''
with engine.connect() as connection:
    noncompliance = pd.read_sql(text, con = connection)
noncompliance

text = '''
SELECT companyname, COUNT(tripduration) AS Instances_Of_Uncleaned_Data
FROM trips
WHERE (tripduration < 1 OR tripduration > 1440) OR tripdistance > 0
GROUP BY companyname
ORDER BY COUNT(tripduration) DESC;
'''
with engine.connect() as connection:
    noncompliance = pd.read_sql(text, con = connection)
noncompliance

In [ ]:
sns.barplot(x=noncompliance['companyname'], y=noncompliance['instances_of_uncleaned_data'])

In [ ]:
text = '''
SELECT COUNT(tripduration) 
FROM trips;
'''
with engine.connect() as connection:
    total_trips = pd.read_sql(text, con = connection)
total_trips

In [ ]:
text = '''
SELECT 
    sumdid,
    COUNT(DISTINCT EXTRACT(DAY FROM pubdatetime))
FROM scooters
WHERE sumdgroup <> 'bicycle'
GROUP BY sumdid;
'''
with engine.connect() as connection:
    day_count = pd.read_sql(text, con = connection)
day_count

In [ ]:
max_days= day_count[day_count['count']==day_count['count'].max()]
max_days